In [ ]:
import pandas as pd

load the database

In [ ]:
df=pd.read_excel('canada.xlsx',
                 skiprows= 20,
                 sheet_name=1,
                 skipfooter=2,
                 
                 )
df

In [ ]:

df.columns

In [ ]:
df['Type']

In [ ]:
df[['AREA',1980,2000]]

In [ ]:
cols=['Type','Coverage','AREA','REG', 'DEV']
df[cols]

preprocessing the data

In [ ]:
df=df.drop(columns=cols)
df.head(2)

In [24]:
df=df.rename(columns={
        'OdName':'country',
        'AreaName':'continent',
        'RegName':'region',
        'DevName': 'status',
})
df.head(2)

,country,continent,region,status,1980,1981,1982,1983,1984,1985,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,Asia,Southern Asia,Developing regions,16,39,39,47,71,340,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Albania,Europe,Southern Europe,Developed regions,1,0,0,0,0,0,...,1450,1223,856,702,560,716,561,539,620,603

In [26]:
df[1980]

0        16
1         1
2        80
3         0
4         0
       ...
190    1191
191       0
192       1
193      11
194      72
Name: 1980, Length: 195, dtype: int64

In [30]:
years=list(range(1980,2014))
df['total']=df[[1980,1981,1982]].sum(axis=1)
df.head()

,country,continent,region,status,1980,1981,1982,1983,1984,1985,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,total
0,Afghanistan,Asia,Southern Asia,Developing regions,16,39,39,47,71,340,...,3436,3009,2652,2111,1746,1758,2203,2635,2004,94
1,Albania,Europe,Southern Europe,Developed regions,1,0,0,0,0,0,...,1223,856,702,560,716,561,539,620,603,1
2,Algeria,Africa,Northern Africa,Developing regions,80,67,71,69,63,44,...,3626,4807,3623,4005,5393,4752,4325,3774,4331,218
3,American Samoa,Oceania,Polynesia,Developing regions,0,1,0,0,0,0,...,0,1,0,0,0,0,0,0,0,1
4,Andorra,Europe,Southern Europe,Developed regions,0,0,0,0,0,0,...,0,1,1,0,0,0,0,1,1,0

In [31]:
df=df.sort_values(by='total')
df.tail(5)

,country,continent,region,status,1980,1981,1982,1983,1984,1985,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,total
36,China,Asia,Eastern Asia,Developing regions,5123,6682,3308,1863,1527,1816,...,42584,33518,27642,30037,29622,30391,28502,33024,34129,15113
136,Philippines,Asia,South-Eastern Asia,Developing regions,6051,5921,5249,4562,3801,3150,...,18139,18400,19837,24887,28573,38617,36765,34315,29544,17221
79,India,Asia,Southern Asia,Developing regions,8880,8670,8147,7338,5704,4211,...,36210,33848,28742,28261,29456,34235,27509,30933,33087,25697
185,United States of America,Northern America,Northern America,Developed regions,9378,10030,9074,7100,6661,6543,...,8394,9613,9463,10190,8995,8142,7676,7891,8501,28482
183,United Kingdom of Great Britain and Northern I...,Europe,Northern Europe,Developed regions,22045,24796,20620,10015,10170,9564,...,7258,7140,8216,8979,8876,8724,6204,6195,5827,67461